-- =====================
-- CREATE TABLE
-- =====================

CREATE TABLE 사원 (
                    사원번호 SERIAL        PRIMARY KEY,
                    이름     VARCHAR(50)  NOT NULL,
                    입사일   DATE         NOT NULL,
                    호봉     INT          NOT NULL default 10,
                    휴대폰   VARCHAR(13) unique
);

INSERT INTO 사원 (사원번호, 이름, 입사일, 호봉, 휴대폰) VALUES
                                            (1101,'김철수', '2018-03-02', 5, '010-1234-5678'),
                                            (1102,'이영희', '2020-07-15', 3, '010-2345-6789'),
                                            (1103,'박민준', '2015-11-01', 8, '010-3456-7890'),
                                            (1201,'이하늘', '2022-01-10', 1, '010-5221-1414'),
                                            (1202,'정석호', '2022-01-10', 1, '010-5512-1513'),
                                            (1203,'고다니엘', '2022-01-10', 1, '010-3145-1964'),
                                            (1204,'김미래', '2022-01-10', 1, '010-5679-1314'),
                                            (1205,'최강희', '2005-01-10', DEFAULT, '010-5123-1234'),
                                            (1206,'김은찬', '2021-03-21', Default, '010-9798-9012');

CREATE TABLE 부서 (
                    부서번호    int        PRIMARY KEY,
                    부서명   VARCHAR(10)  NOT NULL DEFAULT '인사부',
                    부서장   int   unique,
                    사무실   VARCHAR(4)  NOT NULL UNIQUE,
                    전화번호 VARCHAR(13)   UNIQUE
);


INSERT INTO 부서 (부서번호, 부서명, 부서장, 사무실, 전화번호) VALUES
                                               (100,'기획실',1101,'A402', '02-233-1233'),
                                               (200,'비서실',1102,'A501', '02-455-1231'),
                                               (300,'기획실',1201,'B311', '041-567-3454'),
                                               (400,default,1203,'B201', '041-334-6776'),
                                               (500,'자체부',NULL,'A102', '041-4584-5012');


CREATE TABLE 근무하다 (
                      사원번호 INT REFERENCES 사원(사원번호),
                      부서번호     INT REFERENCES 부서(부서번호),
                      직책     VARCHAR(10)  NOT NULL
);

insert into 근무하다 values
                     (1101,100,'부장'),
                     (1102,200,'과장'),
                     (1103,200,'대리'),
                     (1201,100,'부장'),
                     (1202,200,'대리'),
                     (1203,300,'부장'),
                     (1312,100,'부장'),
                     (1312,400,'부장');

select * from 근무하다
where 직책 = '사원';